Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: དེའི་ཚེ་གཏེར་ཆེན་པོ་བདུན་པོ་དེ་དག་ཀྱང་ཆུ་ཞེང་དང་རྔམས་སུ་ཁྲུ་བདུན་ཙམ་དུ་སའི་སྟེང་ནས་མངོན་པར་འཕགས་ཏེ། སྣང་བར་བྱུང་ནས་རྣམ་པར་སྣང་ཞིང་མཛེས་པར་གྱུར་ཏོ། །
en: At that time, those seven great treasures became visible, rising up above the ground to the height and breadth of seven cubits, bright and beautiful.

source: ཁྱིམ་དེར་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་སྣོད་ལྔ་བརྒྱ་ཡང་བྱུང་བར་གྱུར་ཏེ།
en: Inside the house appeared five hundred pots made of various kinds of precious substances.

source: འདི་ལྟར་མར་གྱི་སྣོད་དང་། ཏིལ་མར་གྱི་སྣོད་དང་སྦྲང་རྩིའི་སྣོད་དང་མར་སར་གྱི་སྣོད་དང་། གཞན་དག་ཀྱང་སོ་སོ་ནས་ཡོ་བྱད་སྣ་ཚོགས་ཐམས་ཅད་ཀྱིས་ཡོངས་སུ་གང་བ་དག་སྟེ། འདི་ལྟར་རྡོ་རྗེའི་སྣོད་སྤོས་སྣ་ཚོགས་ཀྱིས་ཡོངས་སུ་གང་བ་དང་།
en: There were pots filled with ghee, pots filled with sesame oil, pots filled with honey, and pots filled with butter.

source: སྤོས་ཀྱི་སྣོད་གོས་སྣ་ཚོགས་ཀྱིས་ཡོངས་སུ་གང་བ་དང་། མན་ཤེལ་གྱི་སྣོད་ཁ་ཟས་དང་།
en: There were individual pots filled with whatever was necessary.

source: སྤྱན་གཟིགས་སྣ་ཚོགས་རོ་མཆོག་ཏུ་ཞིམ་པས་ཡོངས་སུ་གང་བ་དང་། ནོར་བུའི་སྣོད་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱིས་ཡོངས་སུ་གང་བ་དང་། གསེར་གྱི་སྣོད་དངུལ་སིལ་མས་ཡོངས་སུ་གང་བ་དང་། དངུལ་གྱི་སྣོད་གསེར་ཕྱེས་ཡོངས་སུ་གང་བ་དང་ཕྲ་མེན་གྱི་སྣོད་ནོར་བུ་རིན་པོ་ཆེ་བཻ་ཌཱུཪྻས་ཡོངས་སུ་གང་བ་དང་། ཤེལ་གྱི་སྣོད་མུ་ས་ར་གལ་པས་ཡོངས་སུ་གང་བ་དང་། མུ་ས་ར་གལ་པའི་སྣོད་རིན་པོ་ཆེ་ཤེལ་གྱི་ཡོངས་སུ་གང་བ་དང་། ཨ་སྨ་གར་བྷའི་སྣོད་མུ་ཏིག་དམར་པོས་ཡོངས་སུ་གང་བ་དང་། མུ་ཏིག་དམར་པོའི་སྣོད་ཨ་སྨ་གར་བྷས་ཡོངས་སུ་གང་བ་དང་། ནོར་བུ་རིན་པོ་ཆེ་སྐར་མའི་རྒྱལ་མཚན་གྱི་སྣོད་ནོར་བུ་རིན་པོ་ཆེ་ཆུ་འདང་གིས་ཡོངས་སུ་གང་བ་དང་། ནོར་བུ་རིན་པོ་ཆེ་ཆུ་འདང་གི་སྣོད་ནོར་བུ་རིན་པོ་ཆེ་སྐར་མའི་རྒྱལ་མཚན་གྱིས་ཡོངས་སུ་གང་བ་དང་།
en: There were diamond pots filled with every kind of perfume, pots of aromatic wood filled with various kinds of cloth, crystal pots filled with various kinds of enjoyable food delicious with perfect flavors, jewel pots filled with various kinds of precious substances, gold pots filled with silver powder, silver pots filled with gold dust, pots of silver and gold filled with beryl jewels, quartz pots filled with white coral, white-coral pots filled with quartz jewels, emerald pots filled with red pearls, red-pearl pots filled with emeralds, cat’s-eye-jewel pots filled with moonstone jewels, moonstone-jewel pots filled with cat’s-eye jewels, and so on.

source: དེ་དག་ལ་སོགས་པ་རིན་པོ་ཆེའི་སྣོད་ལྔ་བརྒྱ་འཐོན་པར་གྱུར་ཏོ། །
en: Five hundred such precious pots appeared.

source: ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་དེ་བཙས་མ་ཐག་ཏུ་ཁྱིམ་དང་བང་བ་དང་མཛོད་ཐམས་ཅད་དུ་ནོར་དང་འབྲུ་དང་། དབྱིག་དང་། གསེར་དང་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་ཆར་མངོན་པར་བབ་པར་གྱུར་ཏོ། །
en: “As soon as that Sudhana, the head merchant’s son, was born, there fell a rain of wealth, grain, money, gold, and all kinds of jewels in all the storerooms and granaries in the house.

source: དེ་ལ་བྲམ་ཟེའི་ལྟས་པ་དང་། ཕ་དང་མ་དང་གཉེན་གྱི་ཚོགས་ཀྱིས་འདི་བཙས་མ་ཐག་ཏུ་ནོར་མང་པོ་ཕུན་སུམ་ཚོགས་པ་འབྱུང་བར་གྱུར་པས་ན། ནོར་བཟངས་ནོར་བཟངས་ཞེས་དེ་ལྟར་མིང་དུ་བཏགས་ཏེ།
en: “The brahmin prognosticators, his parents, and his relatives said, ‘As soon as he was born there appeared this perfection of much wealth,’ and they gave him the name Sudhana, meaning Excellent Wealth.

source: ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་དེ་ནི་སྔོན་གྱི་རྒྱལ་བ་ལ་བྱ་བ་བྱས་སོ། །དགེ་བའི་རྩ་བ་བསྐྱེད་པའོ། །མོས་པ་རྒྱ་ཆེན་པོ་དང་ལྡན་པའོ། །དགེ་བའི་བཤེས་གཉེན་གྱི་རྗེས་སུ་འབྲང་བའི་བསམ་པ་ཅན་ནོ། །
en: “This Sudhana, the head merchant’s son, has served past jinas, has planted roots of merit, possesses a vast aspiration, and is motivated to follow kalyāṇamitras.

source: ལུས་དང་ངག་དང་ཡིད་ཀྱི་སྤྱོད་པ་ཁ་ན་མ་ཐོ་བ་མེད་པའོ། །
en: His physical, vocal, and mental actions are irreproachable.

source: བྱང་ཆུབ་སེམས་དཔའི་ལམ་ཡོངས་སུ་སྦྱངས་པ་ལ་རབ་ཏུ་བརྩོན་པའོ། །
en: He is dedicated to purifying the bodhisattva path.

source: ཐམས་ཅད་མཁྱེན་པ་ལ་མངོན་པར་མོས་པའོ། །
en: He is focused on omniscience.

source: སངས་རྒྱས་ཀྱི་ཆོས་ཀྱི་སྣོད་དུ་གྱུར་པའོ། །
en: He is a worthy vessel for the Dharma of the buddhas.

source: བསམ་པའི་ནམ་མཁའ་ཡོངས་སུ་དག་པའོ། །
en: He has a pure manner of aspiration.

source: བྱང་ཆུབ་ཀྱི་སེམས་ཆགས་པ་མེད་པ་ཡོངས་སུ་རྫོགས་པའོ། །
en: He has perfected an unimpeded aspiration for enlightenment.”

source: དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་བལྟས་ཏེ། དགའ་བའི་གཏམ་བྱས་ནས་དེ་ལ་འདི་ལྟ་སྟེ། སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ལས་ཀྱང་བརྩམས། སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཡང་དག་པར་བསྡུ་ཞིང་། ཐོབ་པར་བྱ་བ་ལས་ཀྱང་བརྩམས། སངས་རྒྱས་ཐམས་ཅད་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་ལས་ཀྱང་བརྩམས། སངས་རྒྱས་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་ཐམས་ཅད་ཤེས་པར་བྱ་བ་ལས་ཀྱང་བརྩམས།
en: Then Mañjuśrī Kumāra­bhūta looked upon Sudhana, the head merchant’s son, welcomed him, and taught him the Dharma.

source: སངས་རྒྱས་ཐམས་ཅད་ཀྱི་འཁོར་གྱི་དཀྱིལ་འཁོར་རྣམ་པར་དག་པ་ལས་ཀྱང་བརྩམས། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་འཁོར་ལོ་དང་སྤྲུལ་པའི་རྒྱུད་ལས་ཀྱང་བརྩམས། སངས་རྒྱས་ཐམས་ཅད་རྒྱས་ཐམས་ཅད་ཀྱི་གཟུགས་ཀྱི་སྐུའི་མཚན་དང་དཔེ་བྱད་བཟང་པོ་རྣམ་པར་དག་པ་ལས་ཀྱང་བརྩམས། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་སྐུ་ཡོངས་སུ་གྲུབ་པ་ལས་ཀྱང་བརྩམས། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་གསུང་རྣམ་པར་ཕྱེ་བ་ལས་ཀྱང་བརྩམས། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་འོད་ཀྱི་དཀྱིལ་འཁོར་གྱི་བརྒྱན་རྣམ་པར་དག་པ་ལས་ཀྱང་བརྩམས། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་མཉམ་པ་ཉིད་ལས་ཀྱང་བརྩམས་ཏེ། ཆོས་ཀྱང་བསྟན་པར་གྱུར་ཏོ། །དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས།
en: He taught the Dharma through teaching on the Dharma of all the buddhas, on uniting and attaining the Dharma of all the buddhas, on the infinity of all the buddhas, on the successive appearance of all the buddhas, on the pure circles of the followers of all the buddhas, on the display of the Dharma wheels and emanations of all the buddhas, on the pure characteristics and features of the bodies of all the buddhas, on the accomplishment of the Dharma body of all the buddhas, on the display of the speech of all the buddhas, on the pure display of the auras of all the buddhas, and on the equality of all the buddhas.

source: ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་དང་། སྐྱེ་བོའི་ཚོགས་ཆེན་པོ་དེ་དག་ཆོས་དང་མཐུན་པའི་གཏམ་གྱིས་བསྟན་ཏེ། ཡང་དག་པར་བསྐུལ་ནས་སྤྲོ་བ་བསྐྱེད་དེ། དགའ་བར་བྱས་ནས། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དུ་བཙུད་དེ། སྔོན་གྱི་དགེ་བའི་རྩ་བ་ཡོངས་སུ་དྲན་པར་བྱས་ནས།
en: Mañjuśrī Kumāra­bhūta, through speaking about the Dharma, taught, motivated, encouraged, and inspired Sudhana, the head merchant’s son, and that great assembly of beings, and made them develop the aspiration to the highest, complete enlightenment and remember their past roots of merit.

source: སྐྱིད་པའི་འབྱུང་གནས་ཀྱི་གྲོང་རྡལ་དེའི་སེམས་ཅན་རྣམས་ཀྱི་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཆོས་བསྟན་པས། བྱིན་གྱིས་བརླབས་ཏེ་བདེ་བར་བྱས་ནས་དེ་ནས་སོང་ངོ་། །
en: He blessed and made happy the beings from the city of Dhanyākara by teaching them the Dharma according to their wishes, and he departed.

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལས་རྣམ་པ་དེ་ལྟ་བུའི་སངས་རྒྱས་ཀྱི་ཡོན་ཏན་དང་། ཆེ་བ་ཉིད་ཐོས་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མོས་ཤིང་བརྩོན་པས་ཕྱི་བཞིན་དུ་འབྲང་སྟེ།
en: Then Sudhana, the head merchant’s son, having heard from Mañjuśrī Kumāra­bhūta the nature of the greatness and qualities of the buddhas, aspired to the highest, complete enlightenment.

source: འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་ཚིགས་སུ་བཅད་དེ་མངོན་པར་བསྟོད་དོ། །བློ་གྲོས་ཆེན་པོ་མཐའ་ཡས་སྤྱོད་ཡུལ་ཅན། །
en: He diligently followed behind Mañjuśrī Kumāra­bhūta, reciting these verses of praise to him: “Oh wise one!

source: ཁྱོད་ཀྱི་མཐུས་ནི་སེམས་ཅན་སྨན་སླད་དུ། །བདག་ཀྱང་བྱང་ཆུབ་མཆོག་ཏུ་ཞུགས་པར་གྱུར། །
en: Through your power I am set on enlightenment for the benefit of beings.

source: དེ་ལ་ངེས་པ་གང་མཆིས་བདག་ལས་གསོན། །
en: You who have an infinite range of activity, Hear from the certainty that I have.

source: དགའ་བའི་ཆུས་བཀང་འོབས་ཀྱིས་ཀུན་ནས་བསྐོར། །ང་རྒྱལ་དྲེགས་པའི་ར་བ་མཐོ་བར་བརྩེགས། །སེམས་ཅན་ལམ་རྒྱུད་སྒོ་རྣམས་བཙུད་ཅིང་གདངས། །དེ་འདྲའི་ཁྱིམ་ནི་སྲིད་གསུམ་མིང་ལྡན་ཆེ། །
en: {1} “The great city of the three realms of existence Is encircled by a moat of the water of delight, Has the raised walls of pride and conceit, And has the gateways into all the states of beings.

source: དེ་ནི་གཏི་མུག་མ་རིག་གཟིངས་པས་ཁེབས། །འདོད་ཆགས་ཞེ་སྡང་མེ་ལྕེས་རབ་ཏུ་གདུངས། །རྟག་པར་བདུད་ཀྱི་དབང་པོའི་དབང་དུ་གྱུར། །
en: {2} “It is covered by the darkness of ignorance and unknowing; It is burned by the flames of desire and anger And is continuously ruled by the lord of māras: That is where ignorant fools make their home.

source: དེ་ལ་བྱིས་པ་མ་རིག་རྟེན་ཀྱང་འཆའ། །སྲེད་པའི་སྒྲོག་དང་ཞགས་པས་ཤིན་ཏུ་གླགས། །གཡོ་དང་སྒྱུ་ཡི་སྐྱོན་གྱིས་ཐོ་བཙམས་ཤིང་། །ཐེ་ཙོམ་ཡིད་གཉིས་དག་གིས་མིག་མདོངས་པ། །ལོག་པ་ཕྱིན་ཕྱོགས་ལམ་ལ་རབ་ཏུ་ཞུགས། །
en: {3} “Confined in the fetters and chains of craving, Rendered powerless by the defects of deception and deceit, Their eyes blinded by doubt and uncertainty, They are on the path that leads in the wrong direction.

source: ཕྲག་དོག་སེར་སྣའི་ཐག་པས་བཏགས་ཤིང་བཅིངས། །ཡི་དགས་བྱོལ་སོང་སེམས་དམྱལ་མི་ཁོམ་རྒྱུ། །
en: {4} “Bound tightly by the ropes of envy and greed, They go to the unfortunate states of pretas, animals, and hells.

source: རྒ་ཤི་ན་དང་སྐྱེ་བས་རབ་ཏུ་མནར། །མགོ་རྨོངས་ལམ་རྒྱུད་འཁོར་ལོ་ཀུན་ཏུ་འཁོར། །
en: Tormented by aging, death, illness, and rebirth, Bewildered they go around on the wheel of existences.

source: དེ་ལ་ཁྱོད་ནི་ཐུགས་རྗེ་རྣམ་དག་པའི། །དཀྱིལ་འཁོར་ཡེ་ཤེས་འོད་ཟེར་སྣང་བ་མཛད། །ཉོན་མོངས་རྒྱ་མཚོ་བསྐམ་པར་ཤར་ཏེ་འཕགས། །
en: {5} “You shine the light rays of wisdom From the disk of your pure compassion, Which come forth to dry up the ocean of kleśas.

source: ཉི་མ་འདྲ་བས་བདག་ལ་སྣང་བ་མཛོད། །
en: You who are a sun, shine upon me!

source: བྱམས་པ་བསྒོམས་པས་དཀྱིལ་འཁོར་རྫོགས་ཤིང་ཉ། །བསོད་ནམས་ཟླ་འོད་བདེ་བའི་གཟེར་འགྱེད་པ། །སེམས་ཅན་ཀུན་གྱི་གནས་སུ་ཤར་གྱུར་གྱི། །ཟླ་བ་ཉ་བ་ལྟ་བུས་བདག་སྣང་མཛོད། །དཀར་མཐུས་ཐམས་ཅད་ཡོངས་བསྩགས་དཀོར་མངའ་ཞིང་། །
en: {6} “The full disk of your meditation of love, The moonlight of your merit brings happiness, Shining on the dwellings of all beings: You who are like a full moon, shine upon me!

source: ཆོས་དབྱིངས་མཁའ་ལ་ཆགས་པ་མེད་མངའ་བ། །
en: {7} “You possess the treasure of good karma’s power And fly freely through the sky of the essence of phenomena.

source: ཆོས་ཀྱི་འཁོར་ལོ་རིན་ཆེན་སྔོན་འདྲེན་པས། །
en: You bear the precious wheel of the Dharma.

source: རྒྱལ་པོར་གྱུར་པས་བདག་ལ་བསྟན་དུ་གསོལ། །
en: You who are a king, give me your command!

source: བྱང་ཆུབ་ཐེག་པའི་སྨོན་ལམ་མཐུ་མངའ་སྟེ། །
en: {8} “You have the courageous resolution for the path to enlightenment.

source: བསོད་ནམས་ཡེ་ཤེས་ཤིན་ཏུ་ཡངས་བསྩགས་ཤིང་། །སེམས་ཅན་ཀུན་ལ་ཕན་པའི་དོན་ཞུགས་པའི། །
en: You have accumulated vast merit and wisdom, And you set forth for the benefit of all beings.

source: དེད་དཔོན་ཆེན་པོས་བདག་ཀྱང་བསྐྱང་དུ་གསོལ། །
en: Caravan leader, give me your protection!

source: བཟོད་པ་བརྟན་ཞིང་སྲ་བའི་གོ་མནབས་ཏེ། །ཡེ་ཤེས་བཤན་མངའ་ཐུགས་རྗེའི་ཕྱག་རིང་བས། །བདུད་ཀྱི་དམག་དཔུང་ཚོགས་རྣམས་མངོན་གྱུར་པར། །
en: {9} “You wear the armor of strong, unwavering patience; With the sword of wisdom and the long arm of compassion, You confront the army of māras in battle.

source: དཔའ་བ་ཆེན་པོས་བདག་གི་བསེལ་ཡང་མཛོད། །
en: You who are a hero, bring me to safety!

source: ཆོས་ཀྱི་རི་རབ་སྤོ་ལ་བརྟན་བཞུགས་ཤིང་། །ཏིང་འཛིན་མཆོག་གི་ལྷ་མོས་ཀུན་ནས་བསྐོར། །
en: {10} “You dwell on the summit of the Dharma Meru, Encircled by the apsarases of supreme samādhi, Subjugating the asura Rāhu of the kleśas.

source: ཉོན་མོངས་སྒྲ་གཅན་ལྷ་མིན་འདུལ་མཛད་པ། །བརྒྱ་བྱིན་གྱུར་པས་བདག་ཀྱང་གཟིགས་སུ་གསོལ། །
en: You who are Śakra, look upon me!

source: བྱིས་པའི་གནས་གྱུར་ཁམས་གསུམ་ཁང་པ་ན། །ཉོན་མོངས་ལས་རྣམས་རྣམ་པར་བསལ་བ་མཁྱེན། །
en: {11} “In the residence of the three realms where the foolish live, Your knowledge clears away kleśa and karma.

source: རྒྱུ་ཡི་ས་དང་ལམ་རྒྱུད་འཁོར་རྨོངས་པར། །མེ་མར་འདྲ་བས་བདག་ཀྱང་ཤུལ་བསྟན་གསོལ། །
en: In the obscurity of the wheel of existences and the level of causes You are a lamp; reveal to me the way to proceed!

source: ངན་འགྲོའི་ལམ་རྣམས་རྣམ་པར་ཟློག་མཛད་ཅིང་།
en: {12} “You turn from the path that leads to the lower existences.

source: བདེ་བར་འགྲོ་བའི་ལམ་རྣམས་རྣམ་སྦྱོང་བ། །
en: You make pure the path that leads to the happy existences.

source: འཇིག་རྟེན་ཀུན་གྱི་ལམ་གྱི་རྒྱུད་ལས་འདས། །
en: You have transcended all worldly paths.

source: བདག་ལའང་ཐར་པའི་སྒོ་ནི་བསྟན་དུ་གསོལ། །
en: Show me the gateway to liberation!

source: རྟག་དང་བདག་དང་བདེ་བར་འདུ་ཤེས་ལྡན། །ལོག་འཛིན་སྒོ་རེའི་སྐྱབས་ཀྱིས་གཅད་གྱུར་ཀྱིས། །
en: {13} “You close and block the gateway to the false beliefs That have the conceptions of permanence, self, and happiness.

source: བདེན་པའི་ཡེ་ཤེས་སྤྱན་རྣོ་མཆོག་མངའ་བས། །
en: You possess the sharp eyes with the power of the wisdom of truth.

source: ཐར་སྒོ་བདག་ལའང་མྱུར་དུ་དབྱེ་བར་གསོལ། །
en: Quickly open for me the gateway to liberation!

source: ཡང་དག་ལག་པའི་ལམ་ལ་མཁས་གྱུར་ཅིང་། །
en: {14} “You know what are the right and the wrong paths.

source: ལམ་གྱི་རྒྱུས་དང་ཚུལ་ལ་བསྙེངས་མི་མངའ། །ལམ་རྣམས་ཀུན་གྱིས་འདུལ་བ་ཐུགས་ཆུད་པ། །
en: Skilled in the practices and knowledge of the paths, You have mastered the ways of all paths.

source: བདག་ལ་བྱང་ཆུབ་ཤུལ་ནི་བསྟན་དུ་གསོལ། །
en: Teach to me the path to enlightenment!

source: ཡང་དག་ལྟ་བའི་ས་ཡི་ཐད་ལ་བཞུགས། །སངས་རྒྱས་ཀུན་གྱི་ཡོན་ཏན་ཆབ་ཀྱིས་བསྐྲུན། །སངས་རྒྱས་ཆོས་ལེགས་མེ་ཏོག་ཆར་འབེབས་པ། །
en: {15} “You reside upon the plain of the level of the true view, Bring the water of the qualities of all the buddhas, And rain down the flowers of the Buddhadharma’s qualities.

source: བྱང་ཆུབ་ཤུལ་ནི་བདག་ལ་བསྟན་དུ་གསོལ། །
en: Teach to me the path to enlightenment!

source: རྒྱལ་བ་གང་འདས་མ་བྱོན་གང་རྣམས་དང་། །ད་ལྟར་བྱུང་བའི་རྒྱལ་བ་སྣང་མཛད་པ། །སེམས་ཅན་གཙོ་བོ་ལེགས་པར་གཤེགས་པའི་ཕྱོགས། །དེ་ཡང་ལམ་སྒྲོན་མཛད་པས་བདག་བསྟན་གསོལ། །
en: {16} “Revealer of the path, show me The jinas of the past and the future And the jinas who appear in the present, The sugatas, the principal beings in all directions.

source: ལས་ཀྱི་འཁྲུལ་འཁོར་ཚུལ་ལ་མི་བསྙེངས་པ། །ཆོས་ཐེག་ཤིང་རྟའི་འཁྲུལ་འཁོར་མཁྱེན་གྱུར་ཅིང་། །ཡེ་ཤེས་ཐེག་པའི་ཚུལ་ལ་རྣམ་ངེས་པ། །བྱང་ཆུབ་ཐེག་པ་བདག་ལ་བཤད་དུ་གསོལ། །
en: {17} “You who are skilled in employing the apparatus of karma, Proficient in the apparatus of the Dharma vehicle’s chariot, And skilled in employing the apparatus of wisdom, Teach to me the vehicle for enlightenment!

source: མོས་ཤིང་སྨོན་པའི་འཁོར་ལོ་མུ་ཁྱུད་ཅན། །བཟོད་པ་རྡོ་རྗེ་སྙིང་རྗེ་སྲོག་ཤིང་བརྟན། །དད་པའི་གཉའ་ཤིང་རིན་ཆེན་ལེགས་སྤྲས་པའི། །བྱང་ཆུབ་ཐེག་ལ་བདག་ཀྱང་བསྐྱོན་དུ་གསོལ། །
en: {18} “Bring me up onto the vehicle of enlightenment That has the circling wheels of aspiration and resolution, Has the stable axle of patience and vajra compassion, And is beautified by the precious shafts of faith.

source: གཟུངས་རྣམས་ཀུན་གྱི་རྣམ་དག་དཀྱིལ་འཁོར་ཅན། །བྱམས་པ་བརྩེགས་པའི་དགའ་བས་རབ་བརྒྱན་པ། །སོ་སོ་ཡང་དག་རིག་པའི་དྲིལ་འཕྲིང་ཅན། །ཐེག་མཆོག་བཟང་པོ་བདག་ལ་བསྟན་དུ་གསོལ། །ཚངས་པའི་སྤྱོད་པའི་ལམ་གྱིས་མངོན་པར་བརྒྱན། །
en: {19} “Carry me in the excellent, supreme vehicle That has the wheels of all mental retentions, Is adorned by a covering roof of love, And is beautified by the strings of bells of discernment.

source: ཏིང་འཛིན་བུད་མེད་ཁྲག་ཁྲིག་ཀུན་ནས་རྒྱུ། །ཆོས་ཀྱི་རྔ་ཡི་དབྱངས་ཆེན་རབ་བསྒྲགས་པ། །ཐེག་པའི་དམ་པ་བདག་ལ་བསྟབས་སུ་གསོལ། །
en: {20} “Lead me onto the royal vehicle Adorned with a bed of celibacy, Crowded with a hundred billion women of samādhi, And resounding with the sound of Dharma drums.

source: བསྡུ་བ་བཞི་ཡི་མི་ཟད་མཛོད་ལྡན་པ། །ཡེ་ཤེས་རིན་ཆེན་ཡོན་ཏན་ཕྲེང་གིས་བརྒྱན། །ཁྲེལ་ཡོད་དུལ་བའི་འཕྲེང་བས་མཆོག་བསྡམས་པའི། །ཐེག་པའི་དམ་པ་བདག་ལ་བསྟན་དུ་གསོལ། །
en: {21} “Reveal to me the excellent vehicle That has the unending treasure of the four methods of gathering pupils And is adorned by strings of qualities, the jewels of wisdom, Tied with the supreme thongs of self-control and a sense of shame.

source: སྦྱིན་པའི་འོད་ཟེར་དཀྱིལ་འཁོར་བཟང་པོ་ཅན། །ཚུལ་ཁྲིམས་ཙན་དན་སྙིང་རྗེའི་བྱུག་ལྡན་ཞིང་། །བཟོད་པའི་གཟེར་གྱིས་མཚམས་རྣམས་དམ་སྦྱར་བའི། །ཐེག་པའི་མཆོག་ལ་མྱུར་དུ་བདག་བཞག་གསོལ། །སེམས་ཅན་ཐམས་ཅད་འདུལ་ལས་མི་ལྡོག་པ། །
en: {22} “Quickly place me on the supreme vehicle That has the excellent wheels of the light rays of generosity And is anointed with compassion and the sandalwood of good conduct, Its parts held together by the strong nails of patience.

source: བསམ་གཏན་ཏིང་འཛིན་ཁ་ཁྱེར་མཐོར་སྒྲོན་ཅིང་། །ཤེས་རབ་ཐབས་གཉིས་འབྱོར་མཐུན་འགྲོ་རྒྱུ་བའི། །ཆོས་ཀྱི་ཐེག་པའི་མཆོག་ལ་བདག་བཞག་གསོལ། །
en: {23} “Bring me onto the supreme Dharma vehicle That never turns back from guiding beings, Has a carriage of dhyāna built high with samādhi, And is pulled along by the union of wisdom and method.

source: སྨོན་ལམ་འཁོར་ལོས་ལམ་གྱི་འཁོར་སྦྱོང་བ། །ཆོས་ཀྱི་གཟུངས་དམ་མཐུ་བརྟན་ཆེ་ལྡན་ཞིང་། །ཡེ་ཤེས་འཁྲུལ་འཁོར་ལེགས་སྦྱངས་ལེགས་བྱས་པའི། །ཆོས་ཀྱི་ཐེག་པ་དེ་ལ་བདག་སྐྱོན་གསོལ། །
en: {24} “Bring me up onto the vehicle of the Dharma That has the circling of the pure wheels of aspiration, Has the great strength of the firm retention of the Dharma, And is the perfectly well-made device of wisdom.

source: ཀུན་ཏུ་བཟང་པོའི་སྤྱོད་པས་རབ་སྦྱངས་ཤིང་། །སེམས་ཅན་ལྟ་བས་རྒྱུ་ལ་ཐོགས་མེད་པ། །ཀུན་ཏུ་བཟང་པོའི་སྤྱོད་པས་གནོན་གྱུར་པའི། །ཡེ་ཤེས་ཐེག་པས་བདག་ལ་བསྡུད་དུ་གསོལ། །
en: {25} “Lead me onto the vehicle of completely good conduct That has purified completely good conduct And proceeds unhesitatingly to care for beings With overpowering completely excellent conduct.

source: དེ་ནི་བརྟན་པས་རྡོ་རྗེ་བཞིན་གནས་པ། །ཡེ་ཤེས་སྒྱུ་མས་ལེགས་སྦྱངས་ལེགས་བྱས་ཤིང་། །སྒྲིབ་དང་ཆགས་པ་ཐམས་ཅད་གཅོད་པ་ཡི། །བཟང་པོའི་ཐེག་ལ་བདག་ཀྱང་བསྐྱོན་དུ་གསོལ། །
en: {26} “Bring me up onto the excellent vehicle That is enduring, having the nature of a diamond, With perfectly arranged, exquisitely made garlands of wisdom, And cuts through all obstructions and impediments.

source: འགྲོ་མཉམ་དྲི་མེད་ཤིན་ཏུ་ཡངས་གྱུར་པ། །སེམས་ཅན་ཐམས་ཅད་སྐྱོབ་པས་བདེ་སྒྲུབ་ཅིང་། །ཆོས་དབྱིངས་ཤིན་ཏུ་རྒྱ་ཆེན་རྣམ་སྣང་བའི། །བྱང་ཆུབ་ཐེག་ལ་བདག་ཀྱང་བསྐྱོན་དུ་གསོལ། །
en: {27} “Bring me up onto the vehicle of enlightenment, Which is vast, unstained, as extensive as beings, And a refuge for all beings, bringing them happiness And illuminating the vastness of the realm of phenomena.

source: སྡུག་བསྔལ་ཕུང་པོ་རབ་འབྱུང་གཅོད་བྱེད་པ། །ཉོན་མོངས་ལས་ཀྱི་རྡུལ་མང་སྦྱོང་སེལ་ཅིང་། །བདུད་དང་ཕས་ཀྱི་རྒོལ་བ་ཀུན་འཇོམས་པའི། །ཆོས་ཀྱི་ཐེག་ལ་བདག་ཀྱང་བསྐྱོན་དུ་གསོལ། །
en: {28} “Bring me up onto the vehicle of the Dharma, Which cuts through the arising of the mass of suffering, Cleans away the dust circles of karma and kleśas, And crushes all māras and adversaries.

source: ཕྱོགས་རྣམས་ཀུན་ཏུ་ཡེ་ཤེས་རབ་སྣང་བ། །ཆོས་དབྱིངས་ནམ་མཁའ་རྣམ་པར་ཀླུབས་བྱེད་ཅིང་། །སེམས་ཅན་ཀུན་གྱི་བསམ་པ་རྫོགས་བྱེད་པའི། །ཆོས་ཀྱི་ཐེག་ལ་བདག་ཀྱང་བསྐྱོན་དུ་གསོལ། །
en: {29} “Take me on the vehicle of the Dharma, Which has all directions as the scope of its wisdom And is displayed throughout the space of the realm of phenomena, Fulfilling the aspirations of all beings.

source: རྣམ་དག་མཁའ་ལྟར་ཚད་མེད་མི་ཟད་པ། །སྲེད་དང་མ་རིག་ལྟ་བའི་སྐྱོན་མེད་ཅིང་། །སེམས་ཅན་ཀུན་ལ་ཕན་པར་རབ་གནས་པའི། །ཆོས་ཀྱི་ཐེག་ལ་བདག་ཀྱང་བསྐྱོན་དུ་གསོལ། །
en: {30} “Bring me up onto the vehicle of the Dharma, Which is measureless and inexhaustible like pure space, Without the defects of craving and the views of ignorance, And remains so as to benefit all beings.

source: རླུང་ཆེན་ལངས་པའི་ཤུགས་ཀྱི་ཤུགས་ལྡན་པས། །སྨོན་ལམ་མཐུ་ཡིས་འཇིག་རྟེན་ཀུན་འཛིན་ཅིང་། །ཞི་བའི་གནས་རབ་ཀུན་སར་སྐྱེལ་བྱེད་པའི། །ཆོས་ཀྱི་ཐེག་ལ་བདག་ཀྱང་བསྐྱོན་དུ་གསོལ། །
en: {31} “Bring me up onto the vehicle of the Dharma, Which is as fast as the speed of a great wind, Seizes the world with the power of the wind of aspiration, And brings it to the level of the city of peace.

source: ས་ཆེན་བཞི་ཡི་སྟོབས་ཀྱི་སྟོབས་ལྡན་པ། །སྙིང་རྗེའི་མཐུ་དང་ཤུགས་ཀྱིས་ཁུར་ཁྱེར་ཞིང་། །ཡེ་ཤེས་ལོ་ཏོག་འགྲོ་བ་ཉེར་འཚོ་བའི། །ཐེག་པའི་མཆོག་ལ་བདག་ཀྱང་བསྐྱོན་དུ་གསོལ། །
en: {32} “Bring me up onto the supreme vehicle, Which is as unshakable as the great surface of the earth, Carrying its load with the powerful speed of compassion And nourishing beings with the harvest of wisdom.

source: ཉི་མ་ལྟ་བུར་འགྲོ་བ་ཉེར་འཚོ་ཞིང་། །བསྡུ་བ་རབ་ཡངས་འཁོར་གྱི་དཀྱིལ་འཁོར་ཅན། །གཟུངས་ཀྱི་སྟོབས་མཆོག་དག་པའི་འོད་བཟང་བའི། །ཡེ་ཤེས་ཉི་མ་བདག་ལ་བསྟན་ཏུ་གསོལ། །
en: {33} “Reveal to me the sun of wisdom That sustains beings like the sun, An attracting disk with vast light rays, Radiant with supremely pure retention.

source: བསྐལ་པ་མང་པོ་དུ་མར་རབ་བསླབས་པས། རྒྱུ་ཡི་ཚུལ་དང་སུ་ཀུན་མཁས་གྱུར་པ། །
en: {34} “You are wise in the nature of causes and all levels Through having trained for a multitude of numerous kalpas.

source: གང་གིས་འདུས་བྱས་གྲོང་ཁྱེར་གཞོམ་འགྱུར་བའི། །ཤེས་བརྟན་རྡོ་རྗེ་འཕགས་པས་བདག་ལ་སྩལ་དུ་གསོལ། །སངས་རྒྱས་ལེགས་ཀུན་བསླབ་པ་ཕུན་སུམ་གྱིས། །
en: Give me the sublime strong thunderbolt of knowledge That will destroy the city of the composite.

source: ཡེ་ཤེས་རྒྱ་མཚོ་ཡངས་པ་གང་ཞིག་ལ། །ཚད་མེད་རྒྱ་མཚོའི་བློ་མང་བསླབ་གྱུར་པས། །
en: {35} “Within a vast ocean of wisdom You acquired an ocean of unequaled understanding.

source: དེ་ལེགས་ཅི་འདྲ་འཕགས་པས་བཀའ་སྩལ་གསོལ། །
en: Ārya, describe to me the nature of that excellence— That perfect training in all the qualities of the buddhas.

source: གང་ན་ཡང་དག་སྤྱན་མངའ་ཁྱོད་བཞུགས་ཤིང་། །ཡེ་ཤེས་རྒྱལ་པོའི་ཅོད་པན་ལེགས་བརྒྱན་ཏེ། །ཆོས་ཀྱི་དབུ་ཐོད་དམ་པས་དབུ་བཅིངས་པའི། །ཆོས་ཀྱི་རྒྱལ་པོའི་ཕོ་བྲང་བདག་ཀྱང་སྟོན།
en: {36} “May I see the city of the Dharma king Where you reside possessing perfect eyes, Adorned by the royal crown of wisdom, Your head bound with the supreme turban of the Dharma.”

source: དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་གླང་པོའི་ལྟ་སྟངས་ཀྱིས་བལྟས་ཏེ། ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་དེ་ལྟར་ཁྱོད་ཀྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དེ། དགེ་བའི་བཤེས་གཉེན་གྱི་རྗེས་སུ་འབྲང་ཞིང་བྱང་ཆུབ་སེམས་དཔའི་ལམ་ཡོངས་སུ་རྫོགས་པར་བྱ་བར་འདོད་དེ། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཡོངས་སུ་དྲི་བར་བསམ་པ་ལེགས་སོ་ལེགས་སོ། །
en: {37} Then Mañjuśrī Kumāra­bhūta looked with the gaze of an elephant upon Sudhana, the head merchant’s son, and said to him, “Noble one, it is excellent, excellent, that you have developed the aspiration for the highest, complete enlightenment, wish to follow a kalyāṇamitra and complete the path of a bodhisattva, and wish to ask about bodhisattva conduct.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ། དགེ་བའི་བཤེས་གཉེན་རྣམས་ལ་བསྙེན་ཅིང་བསྟེན་པ་དང་། རིམ་གྲོར་བྱ་བ་འདི་ནི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཡོངས་སུ་གྲུབ་པར་འགྱུར་བའི་གཞི་ཡིན་ཏེ་འདི་ནི་མཐུན་པའི་རྒྱུ་ཡིན་གྱིས།
en: “Noble one, it is like this: serving, following, and attending to a kalyāṇamitra is the basis and the corresponding cause for the attainment of omniscience.

source: རིགས་ཀྱི་བུ་དེ་བས་ན་ཁྱོད་ཀྱིས་དགེ་བའི་བཤེས་བསྙེན་བཀུར་བས་ཡོངས་སུ་མ་སྐྱོ་བར་གྱིས་ཤིག །
en: “Therefore, noble one, you should not tire of serving and honoring a kalyāṇamitra.”

source: ནོར་བཟངས་ཀྱིས་སྨྲས་པ། འཕགས་པ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི།
en: Sudhana said, “Ārya, teach me in detail—how does a bodhisattva train in bodhisattva conduct?

source: ཇི་ལྟར་ནན་ཏན་དུ་བགྱི།
en: In what way does a bodhisattva practice it?

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་བརྩམ་པར་བགྱི།
en: How does a bodhisattva commence with bodhisattva conduct?

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་སྤྱད་པར་བགྱི།
en: How does a bodhisattva practice bodhisattva conduct?

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཡོངས་སུ་རྫོགས་པར་བགྱི།
en: How does a bodhisattva perfect bodhisattva conduct?

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཡོངས་སུ་སྦྱང་བར་བགྱི།
en: How does a bodhisattva purify bodhisattva conduct?

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་འཇུག་པ་བགྱི།
en: How does a bodhisattva enter into bodhisattva conduct?

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་མངོན་པར་བསྒྲུབ་པར་བགྱི།
en: How does a bodhisattva attain bodhisattva conduct?

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་རྗེས་སུ་འབྲང་བར་བགྱི།
en: How does a bodhisattva follow bodhisattva conduct?

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་ལྷག་པར་དམིགས་པར་བགྱི། །
en: How does a bodhisattva gain hold of bodhisattva conduct?

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་རྒྱས་པར་བགྱི། །
en: How does a bodhisattva increase bodhisattva conduct?
